# StairSetTopGrUpFlMode

## Description
Sets top graphic on other floor mode of stair - not recommended for use. See also StairGetTopGrUpFlMode.

```pascal
FUNCTION StairSetTopGrUpFlMode(
				stair                      : HANDLE;
				TopGraphicOnOtherFloorMode : INTEGER): BOOLEAN;
```

```python
def vs.StairSetTopGrUpFlMode(stair, TopGraphicOnOtherFloorMode):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE|   |
|TopGraphicOnOtherFloorMode|INTEGER|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Stairs